{
  "title": "Laboratory Notebooks",
  "parents": [
    {
      "app": "x",
      "namespace": null,
      "ident": "a238ec94-5136-48c5-8567-7d2644fda113"
    }
  ],
  "contents": [
    {
      "contents": "I've been using this as a lab notebook for a while, it's rather useful for that.\r\n\r\nI find myself spacing out entries as paragraphs, none of it organised, just stream of consciousness a bit. as a lab notebook should be\r\n\r\nI should find a way to explicitly support that. similar to Time, maybe just a straight up fork of Time.\r\n\r\nexcept with a chat interface. every entry added as a new block. every entry uneditable. be sure before you hit send.\r\n\r\nI will think about my words more, less emotion.  wouldn't want that on the record\r\n\r\nbut the chat interface I think is important. a text field to add lines, and enter or ctrl return to persist. easy to attach photos.\r\n\r\nwe're not aiming for 21 CFR Part 11. the files in git will always be accessible (under the majority of deployment scenarios for myself.) git isn't immutable though that can be enforced server side i suppose, no rewrites, so, it would in theory be possible to get somewhat close?\r\n\r\ni can imagine two flavours, strict (WORM, and editable) i suppose 'editable' doesn't imply 'easily editable', but without that severe restriction is probably nice for some uses. (personal notebook)\r\n\r\nthis could just be the 'new' time, it could just be the default behaviour tbh, with different 'classes'. by backend? by type? i'll edit meeting notes on the fly to recontextualise them, but for laboratory things i'm not going to.",
      "author": {
        "app": "accountgithub",
        "namespace": "gh",
        "ident": "hexylena"
      },
      "type": "markdown",
      "id": "e44fda22-f530-4062-97de-843fd3ab667a",
      "created_unix": 1755249988.5115223,
      "updated_unix": 1755249988.5115225
    },
    {
      "contents": "there's also occasions where I don't want to start a formal time log, just wanna add some notes. it could be instantaneous for all I care. just popped into the office to check a print and made a photo, I have notes. wanna stash somewhere. it would be nice to pick the \"activity\" from a \"chat\" interface and add these notes.\r\n\r\nwould I add to the project? just make a new chat? continue the earlier one? then it's not time logs but an aggregation of them by title.\r\n\r\nthe aggregation is odd, or, maybe it's titling the logs that's odd. they're all direct children of a project, but there's a pseudo layer in there by title. subtasks that were never split out or aggregated. \r\n\r\nshould adding a time log auto create a task/note within a project? then I can \"continue\" more easily?",
      "author": {
        "app": "accountgithub",
        "namespace": "gh",
        "ident": "hexylena"
      },
      "type": "markdown",
      "id": "2d3596e1-00ff-4b49-b04f-1f0ed9686b88",
      "created_unix": 1755254065.9310105,
      "updated_unix": 1755254065.9310114
    }
  ],
  "tags": [],
  "tags_v2": [],
  "version": 2,
  "created_unix": 1755248512.433171,
  "updated_unix": 1755248512.4331713,
  "namespace": null,
  "type": "note",
  "attachments": []
}